Revit 2024 API
MechanicalSystem Class
 A mechanical system element.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class MechanicalSystem : MEPSystem
Visual Basic
Public Class MechanicalSystem _
	Inherits MEPSystem
Visual C++
public ref class MechanicalSystem : public MEPSystem
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.MEPSystem
 Autodesk.Revit.DB.Mechanical.MechanicalSystem
See Also
MechanicalSystem Members
Autodesk.Revit.DB.Mechanical Namespace